app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "date_time", "address", "price", "website", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save

SELECT "events".* FROM "events" WHERE (date_time BETWEEN '2018-01-04' AND '2018-01-05')
SELECT "events".* FROM "events"
---
  def index
    # @events = Event.all
    @events = Event.where(nil) # creates an anonymous scope
    #Todo setup default filter for today's date
    @events = @events.date(params[:date]) if params[:date].present?